"""
Задание 2.

Реализовать класс Road (дорога), в котором определить защищенные атрибуты:
length (длина в метрах), width (ширина в метрах).

Значения данных атрибутов должны передаваться при создании экземпляра класса.

Реализовать публичный метод расчета массы асфальта, необходимого для покрытия
всего дорожного полотна.

Использовать формулу: длина * ширина * масса асфальта для покрытия одного кв
метра дороги асфальтом, толщиной в 1 см * число м толщины полотна.
Массу и толщину сделать публичными атрибутами.
Проверить работу метода.

Например: 20м*5000м*25кг*0.05м = 125000 кг = 125 т
"""

class Road:
    _length = 0
    _width = 0
    weight = 0
    thickness = 0

    def __init__(self, length, width):
        self._length = length
        self._width = width

    def calc_of_mass(self, weight, thickness):
        return self._length * self._width * weight * thickness

r = Road(20, 5000)
mass = r.calc_of_mass(25, 0.05)
if mass / 1000 != 0: print(f"{mass} кг = {mass / 1000} тон")